erp3l/src/Catalogs/ЦенныеБумаги/ЦенныеБумаги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦенныеБумаги</name>
  <comment>(БезМодуляОбъектаУХ) (БезМодуляМенеджераУХ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаНоминала</name>
    <comment>БПМСФО</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>БиржевойКод</name>
    <comment>ISIN или иное</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <comment>БПМСФО</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКотировки</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Биржа</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИерархииСправедливойСтоимости</name>
    <type>
      <types>EnumRef.УровеньИерархииСправедливойСтоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФормаВекселя</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ФормаВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>Котировка</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяЦБ</name>
    <comment>для векселя и облигации (УХ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <comment>БПМСФО</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПогашения</name>
    <comment>БПМСФО</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПереводнойВексель</name>
    <comment>(УХ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Должник</name>
    <comment>БПМСФО</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоручитель</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВыпуска</name>
    <comment>(УХ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМестоПлатежа</name>
    <comment>(УХ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМестоСоставления</name>
    <comment>(УХ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписантРуководитель</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписантГлавныйБухгалтер</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйПолучатель</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <comment>(УХ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <comment>(УХ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЦеннойБумаги</name>
    <comment>(УХ)</comment>
    <type>
      <types>DocumentRef.ПараметрыЦеннойБумагиВексель</types>
      <types>DocumentRef.ВерсияГрафикаЦеннойБумаги</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаФИ</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаФинансовыхИнструментовМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАктуализацииЗаявок</name>
    <type>
      <types>EnumRef.РежимыАктуализацииЗаявокПоГрафикам</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБиржевойРынок</name>
    <comment>(УХ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ЦенныеБумаги/ObjectModule.bsl
// ++ УХ_Интеграция
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКопировании(ОбъектКопирования)
	ПараметрыЦеннойБумаги = Неопределено;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидФинансовогоИнструмента = Перечисления.ВидыФинансовыхИнструментов.Вексель Тогда
		
		// Исключим реквизиты, заполняемые методом ЗаполнитьРеквизитыСправочникаПоДокументу.
		МассивНепроверяемыхРеквизитов.Добавить("ВалютаНоминала");
		МассивНепроверяемыхРеквизитов.Добавить("Номинал");
		МассивНепроверяемыхРеквизитов.Добавить("Эмитент");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВыпуска");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПогашения");
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйПолучатель");
		МассивНепроверяемыхРеквизитов.Добавить("Должник");
		
	ИначеЕсли ВидФинансовогоИнструмента <> Перечисления.ВидыФинансовыхИнструментов.Облигация Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СрокПогашения");
		
	КонецЕсли;
	
	Если ЭтоГруппа Или Не ЭтоБиржевойРынок Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Биржа");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПараметрыЦеннойБумаги") Тогда
		// Есть документ с данными. Установим ссылку, заполним реквизиты справочника, 
		// синхронизируем пометку удаления
		Если ЗначениеЗаполнено(ДополнительныеСвойства.ПараметрыЦеннойБумаги.Ссылка) Тогда
			ПараметрыЦеннойБумаги = ДополнительныеСвойства.ПараметрыЦеннойБумаги.Ссылка;
		Иначе
			ПараметрыЦеннойБумаги = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДополнительныеСвойства.ПараметрыЦеннойБумаги.Ссылка).ПолучитьСсылку();
			ДополнительныеСвойства.ПараметрыЦеннойБумаги.УстановитьСсылкуНового(ПараметрыЦеннойБумаги);
		КонецЕсли;
		
		ЗаполнитьРеквизитыСправочникаПоДокументу(ДополнительныеСвойства.ПараметрыЦеннойБумаги);
		
		ДополнительныеСвойства.ПараметрыЦеннойБумаги.ПометкаУдаления = ПометкаУдаления;
		
	ИначеЕсли Не ЗначениеЗаполнено(ПараметрыЦеннойБумаги) Тогда
		// Создаем новый документ, заполняем его по объекту. Устанавливаем ссылку.
		ИмяДокумента = ЦенныеБумагиКлиентСерверПовтИсп.ПолучитьИмяДокумента(ВидФинансовогоИнструмента);
		Если ЗначениеЗаполнено(ИмяДокумента)Тогда
			МенеджерДокумента = Документы[ИмяДокумента];
			ДокументПараметры = МенеджерДокумента.СоздатьДокумент();
			ДокументПараметры.Заполнить(ЭтотОбъект);
			ПараметрыЦеннойБумаги = МенеджерДокумента.ПолучитьСсылку();
			ДокументПараметры.УстановитьСсылкуНового(ПараметрыЦеннойБумаги);
			ДополнительныеСвойства.Вставить("ПараметрыЦеннойБумаги", ДокументПараметры);
		КонецЕсли;
	Иначе
		// Документ есть, но он не был получен ранее. Синхронизируем только пометку удаления.
		Если ПометкаУдаления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
			ДокументПараметры = ПараметрыЦеннойБумаги.ПолучитьОбъект();
			ДокументПараметры.ПометкаУдаления = ПометкаУдаления;
			ДополнительныеСвойства.Вставить("ПараметрыЦеннойБумаги", ДокументПараметры);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПараметрыЦеннойБумаги") Тогда
		ДополнительныеСвойства.ПараметрыЦеннойБумаги.ФинансовыйИнструмент = Ссылка; // для надежности.
		Если Не ДополнительныеСвойства.ПараметрыЦеннойБумаги.ПометкаУдаления Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		ИначеЕсли ДополнительныеСвойства.ПараметрыЦеннойБумаги.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		ДополнительныеСвойства.ПараметрыЦеннойБумаги.Записать(РежимЗаписи);
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьРеквизитыСправочникаПоДокументу(ДокументПараметры)
	
	Если ТипЗнч(ДокументПараметры.Ссылка) = Тип("ДокументСсылка.ПараметрыЦеннойБумагиВексель") Тогда
		
		ВалютаНоминала		= ДокументПараметры.ВалютаНоминала;
		Номинал				= ДокументПараметры.Номинал;
		Эмитент				= ДокументПараметры.Векселедатель;
		ДисконтнаяЦБ		= Не ДокументПараметры.ПредусмотренПроцентныйДоход;
		ДатаВыпуска			= ДокументПараметры.ДатаСоставления;
		СрокПогашения		= ДокументПараметры.ДатаОкончанияНачисленияПроцентов;
		ПервыйПолучатель	= ДокументПараметры.ПервыйПолучатель;
		Должник				= ДокументПараметры.Должник;
	ИначеЕсли ТипЗнч(ДокументПараметры.Ссылка) = Тип("ДокументСсылка.ВерсияГрафикаЦеннойБумаги") Тогда
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли

// -- УХ_Интеграция
